# !/usr/bin/env python3
# -*- coding:utf-8 -*-

# @Time    : 2024/11/12 15:42
# @Author  : wangchongshi
# @Email   : wangchongshi.wcs@antgroup.com
# @FileName: prod_description.py

PROD_A_DESCRIPTION = """
宠物医保（体验版）
1、保险产品：
    "宠物医保（体验版）"（以下简称"赠险"）免费体验30天，到期后会自动承接付费版"宠物医保"（以下简称"商险"），商险保障期12个月。
2、投/被保险人：
    在中华人民共和国境内（不包括港、澳、台地区），饲养或受他人委托临时代为饲养（以下统称"饲养"）宠物的年满16周岁的具备完全民事行为的个人，可作为本保险的投被保险人。
3、被保险宠物：
    本保险合同承保的宠物（以下简称"被保险宠物"）为被保险人以玩赏、陪伴为目的而合法饲养的、可明确鉴别身份的年龄为60天-10周岁的犬类或猫类宠物。
4、保险期限：
    "赠险"：自投保申请核保通过后次日零时生效，保险期间30天（具体以保单载明的起讫时间为准），若被保险宠物年龄不满足60天也可进行领取并约定保险生效日期（约定的保险起讫时间将在保单中载明），等待期从生效之日起算；
    "商险"：自投保申请核保通过后，于30天后（或者"赠险"保险期间结束后）的次日零时生效，保险期间12个月（具体以保单载明的起讫时间为准）。
5、"赠险"保障责任： 
    用于报销猫、狗宠物因常见疾病、意外事故而导致的医疗费用。先天、遗传性疾病不在本产品保障范围内。具体保障方案如下：
        1. 保障总额：20000元
        2. 免赔额：门诊0元，手术0元
        3. 报销比例: 定点医院70%（若上一年未发生理赔，赔付比例上调10%，最高可达90%），非定点医院40%（若上一年未发生理赔，赔付比例上调10%，最高可达60%）
        4. 单次事故赔付上限：门诊1200元，手术2000元
        5. 等待期: 意外医疗保险责任10天，肿瘤和口腔疾病60天，其他疾病30天。
        6. 保障详情：在保险期间内，被保险人饲养的、在本保险合同中载明的被保险宠物在等待期届满后遭受意外伤害事故或罹患疾病，因此在本保险合同中载明的宠物医疗机构接受本保险合同载明的医疗项目治疗的，对于被保险人支付的必要的、合理的医疗费用，保险人按照本合同的约定负责赔偿。被保险宠物在保险期间内接受上述治疗，本合同保险期间届满时，被保险宠物未结束本次治疗的，保险人根据本保险合同约定继续承担保险责任，延长保险责任期间由投保人与保险人协商确定，但最长不超过30天，并在本保险合同中载明。
    
    注意点：
        1. "赠险"和"商险"是各自独立保单，"赠险"保障期限30天，"商险"保障期限12个月。
        2. "赠险"体验到期自动承保"商险"的保障方案是升级版，保障责任不变，是一致的。
        3. "赠险"等待期是意外医疗保险责任10天（赠险30天保障期限内，10天等待期过后意外医疗保险即可享理赔服务），肿瘤和口腔疾病60天，其他疾病30天。若免费体验30天后转为付费版"商险"，免费体验的30天保障期限也计入等待期，"商险"生效后意外伤害、普通疾病免等待期，肿瘤及口腔疾病剩余30天等待期。
        4. 第二年"商险"续保成功的话无等待期。
6、增值服务：
    "赠险"可享受每月200元消费额度（本折扣额度非现金，为权益抵扣价值），在蚂蚁宠物商城买药、买服务可享优惠。体验30天到期转付费版商险可额外再享受三项增值服务：犬多联/猫三联疫苗一针、体外驱虫一支、宠物医师电话咨询。
    
    注意点：
        1. "赠险"下发的200元消费额度，未使用部分不可折现，若赠险保单失效则消费额度一同失效。后续如果自动承接"商险"，则"商险"每月下发的200元消费额度在"商险"保障期间（12个月）内可累积，最高可达2400元。
        2. 本产品赠送的增值服务使用者需与投保宠物为同一只宠物，不得转赠其他宠物。
        3. 赠险体验30天到期转付费版商险，商险使用增值服务后（消费额度除外），视为用户同意在保至少4个月及以上（期间不办理退保）。即对于商险月缴用户，视为同意在保单完成缴纳4期保费前不进行退保；对于商险年缴用户视为同意在投保4个月前不进行退保。

7、缴费方式及金额：
    30天的"赠险"产品属于赠送福利，免费体验，无需缴纳保险费。
    本产品保障期满会自动承接"商险"，有月缴和年缴两种缴费方式，可根据需求自行选择：
        a. 月缴：猫类月保费为34.08元，犬类月保费为37.5元。总共12期，首期扣款时间为前序"赠险"30天保障期结束的前10天（含终止日）。剩余11期的扣款日，是每月的"商险"保单生效日，如果当月该天不存在，就提前到当月的最后一天。举例，"赠险"是2024年1月29号保障期终止，那么后续"商险"的月缴首期扣款日是2024年1月20号，"商险"是2024年1月30号生效，第二期扣款日是2024年2月29号（因为当月30号不存在），第三期扣款日是2024年3月30号，以此类推。
        b. 年缴：猫类年保费为409元，犬类年保费为450元，一次性为12个月的"商险"全额缴费。扣款时间为前序"赠险"30天保障期结束的前10天（含终止日）。举例，"赠险"是2024年1月29号保障期终止，那么后续"商险"的年缴扣款日是2024年1月20号。
        
    注意点：
        1. 缴费方式选定后，保障期限内不可更改。
        2. 缴费账号是被保人的支付宝账号，支持与其支付宝账号绑定的多种支付渠道（例如余额、银行卡、信用卡等）。
        3. 基于金额的四舍五入，月缴和年缴的最终的保费总额是一致的。
8、产品犹豫期：
本产品无犹豫期。
9、续保规则：
    赠险不存在续保的情况，赠险保障期限30天，保障到期自动承接商险。
    商险续保规则如下：
        1. 不保证续保。
        2. 您在本年度投保时选择了开通下一年延续保障（以下简称"续保"）服务并同意相关服务协议，或在该保单到期前30天内或到期后15天内为同一被保险人重新申请投保的，经保险人审核同意后缴纳保费，重新获得新的保险合同，续保时会根据上一年度风险重新厘定具体缴纳保费以保单展示为准、保障范围以重新出具的保单约定及对应投保须知内容为准。
        3. 本年度未出险的，续保保单赔付比例提高10%（定点医院最高赔付比例为90%，非定点医院最高赔付比例为60%）；若续保保单出险，第三年经保险人审核同意续保的，定点医院赔付比例恢复到70%，非定点医院赔付比例恢复到40%。
10、产品合同解除（退保）规则：
    赠险期间可以随时取消或退保，可以在【蚂蚁保】-【我的】-【全部保单】中找到对应保单进行操作，退还保费为0元。
    "赠险"生效后，免费体验期为30天，到期后会自动承接至付费版"商险"，"商险"退保规则如下：
        1. 保单未生效：保单未生效申请退保，将全额退还已缴纳的保险费；
        2. 保单已生效：
          a. 年缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：未满期保险费=保险费×(1- 保险单已经过天数/保险期间天数)。
          b. 月缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：退还未满期保险费=本合同当期月度保险费×(1-当月实际经过天数/当月实际天数）。
    注意点：
        1. 商险保障期限为12个月，期间支持退保，但若使用增值服务后（消费额度除外），视为用户同意连续在保4个月及以上（期间不办理退保）

11、其他说明：
    1. 等待期：指自本合同保险期间开始之日起连续计算的一段时间，具体天数由保险人和投保人在投保时约定并在本保险合同上载明，连续性投保无等待期。在等待期内发生保险事故的，保险人不承担给付保险金的责任。
    2. 宽限期：若你选择月缴分期付款，则缴费宽限期为15天，若超过缴费宽限期仍未能完成保费缴纳，保单及增值服务均自动失效，保单终止日期为上一缴费期最后一天。宽限期内保障不变，宽限期内，即使没有交费，出险依然能赔。过了宽限期没有交费，保单效力中止，出险不赔。
    3. 消费额度：随保每月下发200元消费额度（也可以叫做消费折扣特权或健康服务折扣权益），只在当前保单有效期内可累计。该额度可用于在"蚂蚁宠物"内以优惠价格购买药品、服务等。本折扣额度非现金，为权益抵扣价值。
    4. 先天性疾病/畸形、遗传性疾病释义及具体病种清单：
    （1）先天性疾病、先天性畸形：指被保险宠物出生时就具有的疾病、畸形或身体健康异常。
    （2）遗传性疾病：指生殖细胞或受精卵的遗传物质（染色体和基因）发生突变或畸变所引起的疾病，通常具有由亲代传至后代的垂直传递的特征。
    （3）具体病种清单：
        a. 代谢性等疾病：血友病，尼曼匹克综合征先天性凝血因子缺乏，先天肌无力，丙酮酸肌酸缺乏，甘露糖贮积症，II型糖尿病，肢端肥大，胱氨酸尿症，新生犬／猫黄疸症
        b. 心血管系统疾病：先天性门静脉短路心室间隔缺损，心膜内壁缺损，室中隔缺损，二尖瓣发育不良三尖瓣发育不良，瓣膜闭锁不全，法洛氏四重畸形，房中隔缺损，右主动脉弓，三心房，法洛四联症，猫肥厚性心肌病，动脉导管未闭（PDA、永久性动脉导管），肺动脉瓣狭窄
        c. 眼部疾病：眼睑内翻，眼睑外翻，倒睫，异位睫，双行睫，小眼球症，先天性视网膜失养症，视网膜发育不全先天性白内障，视网膜萎缩，第三眼睑脱出，瞬膜软骨变形（内翻、外翻），Merle 眼发育异常，遗传性视网膜变性症，原发性青光眼，无晶状体症小晶状体症，晶状体缺损，圆锥晶状体，永存玻璃体动脉，原始玻璃体持续增生症，晶状体血管膜持续增生症，永存瞳孔膜，虹膜发育不良，虹膜缺损，眼前节发育不良脉络膜发育不良，视（神经）盘发育不良
        d. 骨关节系统：腭裂，肘关节发育不良，髋关节发育不良，髌骨脱位，软骨病，折耳猫骨骼疾病，斜颈，多指畸形，品种特异性关节炎综合征，漏斗胸，半椎体，骶尾发育不全。
        e. 神经性疾病：先天性前庭综合征，先天性癫痫，小脑发育不良，非获得性脑积水
        f. 口腔疾病：双排牙，咬合不正
        g. 泌尿系统疾病：输尿管异位，先天性尿道狭窄
        h. 呼吸系统疾病：哮喘，短鼻综合征，软腭过长症，气管塌陷，鼻塌陷，喉管塌陷，气管狭窄，扁平胸，漏斗胸
        i. 其他先天性、遗传性疾病：任何部位的发育不良，血小板减少性紫癜，隐睾，先天性凝血功能障碍，唇裂，晕车症，腹壁疝，食物性变态反应，脐疝，自身免疫介导性溶血，腹股沟阴囊疝，重症肌无力，会阴疝，先天性食道无力，膈疝，门静脉高压症
"""

PROD_B_DESCRIPTION = """
宠物医保
1、保险产品：
    "宠物医保"（以下简称"商险"）保障期限12个月，是付费版商业险，有三个保障：基础版、升级版、尊享版。
2、投/被保险人：
    在中华人民共和国境内（不包括港、澳、台地区），饲养或受他人委托临时代为饲养（以下统称"饲养"）宠物的年满16周岁的具备完全民事行为的个人，可作为本保险的投被保险人。
3、被保险宠物：
    本保险合同承保的宠物（以下简称"被保险宠物"）为被保险人以玩赏、陪伴为目的而合法饲养的、可明确鉴别身份的年龄为60天-10周岁的犬类或猫类宠物。
4、保险期限：
    "商险"：自投保申请核保通过后次日零时生效，保险期间12个月（具体以保单载明的起讫时间为准）。
5、"商险"保障责任：
    用于报销猫、狗宠物因常见疾病、意外事故而导致的医疗费用。先天、遗传性疾病不在本产品保障范围内。具体责任上，分为三个保障方案：基础版、升级版、尊享版，具体方案如下：
        1. 保障总额：基础版10000元，升级版20000元，尊享版30000元
        2. 免赔额：基础版、升级版、尊享版均一样，门诊0元，手术0元
        3. 报销比例: 定点医院70%（若上一年未发生理赔，赔付比例上调10%，最高可达90%），非定点医院40%（若上一年未发生理赔，赔付比例上调10%，最高可达90%）
        4. 单次事故赔付上限：1）基础版：门诊500元，手术1000元；2）升级版：门诊1200元，手术2000元；3）尊享版：门诊2000元，手术3000元
        5. 等待期: 首次或非连续投保本保险时，意外医疗保险责任10天，肿瘤和口腔疾病60天，其他疾病30天。
        6. 保障详情：在保险期间内，被保险人饲养的、在本合同中载明的被保险宠物在等待期届满后遭受意外伤害事故或罹患疾病，因此在本合同中载明的宠物医疗机构接受本合同载明的医疗项目治疗的，对于被保险人支付的必要的、合理的医疗费用，保险人按照本合同的约定负责赔偿。保险期满时，被保险宠物仍然需要接受治疗的，保险人根据本合同的约定继续承担保险责任，最长截至保险期满之日起第30日止。
    注意点：
        1. 第二年"商险"续保成功的话无等待期。
        
6、增值服务：
    增值服务是本产品赠送的高价值宠物健康服务。具体包括包括以下服务：
        1）基础版：邮寄体外驱虫药1支；电话问诊咨询；每月200元消费额度。
        2）升级版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；每月200元消费额度。
        3）尊享版：邮寄体外驱虫药1支；电话问诊咨询；犬多联/猫三联疫苗一针；狂犬疫苗1针；全面体检1次（含粪检、血常规）；每月200元消费额度。

    注意点：
        1. 每月下发200元消费额度（本折扣额度非现金，为权益抵扣价值），该额度在"蚂蚁宠物"小程序中购买药品、健康护理可享一定优惠，该额度在"商险"12个月保障期间内可每月累积，未使用部分不可折现，若保单失效，则消费额度一同失效。
        2. 本产品赠送的增值服务使用者需与投保宠物为同一只宠物，不得转赠其他宠物。
        3. "商险"使用增值服务后（消费额度除外），视为用户同意在保至少4个月及以上（期间不办理退保）。即对于月缴用户，视为同意在保单完成缴纳4期保费前不进行退保；对于年缴用户视为同意在投保4个月前不进行退保。
        4. 增值服务有效期同保单有效期。

7、缴费方式及金额：
    本保险方案有月缴和年缴两种缴费方式，可根据需求自行选择：
        a. 月缴：基础版，猫类月保费为17.33元，犬类月保费为21.58元；升级版，猫类月保费为34.08元，犬类月保费为37.5元；尊享版，猫类月保费67.08元，犬类月保费73元。总共12期，首期付款时间为投保当日。剩余11期的扣款日，是每月的"商险"保单生效日，如果当月该天不存在，就提前到当月的最后一天。举例，被保人2024年1月29号投保"商险"并选择月缴方式，则当天2024年1月29号进行首期付款，"商险"于次日2024年1月30号生效，第二期扣款日是2024年2月29号（因为当月30号不存在），第三期扣款日是2024年3月30号，以此类推。
        b. 年缴：基础版，猫类年保费为208元，犬类年保费为259元；升级版，猫类年保费为409元，犬类年保费为450元；尊享版，猫类年保费805元，犬类年保费876元。需要在投保当日一次性全额扣款。
    注意点：
        1. 缴费方式选定后，保障期限内不可更改。
        2. 缴费账号是被保人的支付宝账号，支持与其支付宝账号绑定的多种支付渠道（例如余额、银行卡、信用卡等）。
        3. 基于金额的四舍五入，月缴和年缴的最终的保费总额是一致的。
8、产品犹豫期：
本产品无犹豫期。
9、续保规则：
    商险是不保证续保的。
    您在本年度投保时选择了开通下一年延续保障（以下简称"续保"）服务并同意相关服务协议，或在该保单到期前30天内或到期后15天内为同一被保险人重新申请投保的，经保险人审核同意后缴纳保费，重新获得新的保险合同，续保时会根据上一年度风险重新厘定具体缴纳保费以保单展示为准、保障范围以重新出具的保单约定及对应投保须知内容为准。
    本年度未出险的，续保保单赔付比例提高10%（定点医院最高赔付比例为90%，非定点医院最高赔付比例为60%）；若续保保单出险，第三年经保险人审核同意续保的，定点医院赔付比例恢复到70%，非定点医院赔付比例恢复到40%。
10、产品合同解除（退保）规则：
    1. 保单未生效：保单未生效申请退保，将全额退还已缴纳的保险费；
    2. 保单已生效：
        a. 年缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：未满期保险费=保险费×(1- 保险单已经过天数/保险期间天数)。
        b. 月缴保单：在保单生效后申请退保的，将退还未满期保险费。计算公式为：退还未满期保险费=本合同当期月度保险费×(1-当月实际经过天数/当月实际天数）。
    注意点：
        1. 商险保障期限为12个月，期间支持退保，但若使用增值服务后（消费额度除外），视为用户同意连续在保4个月及以上（期间不办理退保）
11、其他说明：
    1. 等待期：指自本合同保险期间开始之日起连续计算的一段时间，具体天数由保险人和投保人在投保时约定并在本保险合同上载明，连续性投保无等待期。在等待期内发生保险事故的，保险人不承担给付保险金的责任。
    2. 宽限期：若你选择月缴分期付款，则缴费宽限期为15天，若超过缴费宽限期仍未能完成保费缴纳，保单及增值服务均自动失效，保单终止日期为上一缴费期最后一天。宽限期内保障不变，宽限期内，即使没有交费，出险依然能赔。过了宽限期没有交费，保单效力中止，出险不赔。
    3. 消费额度：随保每月下发200元消费额度（也可叫做消费折扣特权或健康服务折扣权益），只在当前保单有效期内可累计。该额度可用于在"蚂蚁宠物"内以优惠价格购买药品、服务等。
    4. 先天性疾病/畸形、遗传性疾病释义及具体病种清单：
    （1）先天性疾病、先天性畸形：指被保险宠物出生时就具有的疾病、畸形或身体健康异常。
    （2）遗传性疾病：指生殖细胞或受精卵的遗传物质（染色体和基因）发生突变或畸变所引起的疾病，通常具有由亲代传至后代的垂直传递的特征。
    （3）具体病种清单：
        a. 代谢性等疾病：血友病，尼曼匹克综合征先天性凝血因子缺乏，先天肌无力，丙酮酸肌酸缺乏，甘露糖贮积症，II型糖尿病，肢端肥大，胱氨酸尿症，新生犬／猫黄疸症
        b. 心血管系统疾病：先天性门静脉短路心室间隔缺损，心膜内壁缺损，室中隔缺损，二尖瓣发育不良三尖瓣发育不良，瓣膜闭锁不全，法洛氏四重畸形，房中隔缺损，右主动脉弓，三心房，法洛四联症，猫肥厚性心肌病，动脉导管未闭（PDA、永久性动脉导管），肺动脉瓣狭窄
        c. 眼部疾病：眼睑内翻，眼睑外翻，倒睫，异位睫，双行睫，小眼球症，先天性视网膜失养症，视网膜发育不全先天性白内障，视网膜萎缩，第三眼睑脱出，瞬膜软骨变形（内翻、外翻），Merle 眼发育异常，遗传性视网膜变性症，原发性青光眼，无晶状体症小晶状体症，晶状体缺损，圆锥晶状体，永存玻璃体动脉，原始玻璃体持续增生症，晶状体血管膜持续增生症，永存瞳孔膜，虹膜发育不良，虹膜缺损，眼前节发育不良脉络膜发育不良，视（神经）盘发育不良
        d. 骨关节系统：腭裂，肘关节发育不良，髋关节发育不良，髌骨脱位，软骨病，折耳猫骨骼疾病，斜颈，多指畸形，品种特异性关节炎综合征，漏斗胸，半椎体，骶尾发育不全。
        e. 神经性疾病：先天性前庭综合征，先天性癫痫，小脑发育不良，非获得性脑积水
        f. 口腔疾病：双排牙，咬合不正
        g. 泌尿系统疾病：输尿管异位，先天性尿道狭窄
        h. 呼吸系统疾病：哮喘，短鼻综合征，软腭过长症，气管塌陷，鼻塌陷，喉管塌陷，气管狭窄，扁平胸，漏斗胸
        i. 其他先天性、遗传性疾病：任何部位的发育不良，血小板减少性紫癜，隐睾，先天性凝血功能障碍，唇裂，晕车症，腹壁疝，食物性变态反应，脐疝，自身免疫介导性溶血，腹股沟阴囊疝，重症肌无力，会阴疝，先天性食道无力，膈疝，门静脉高压症
"""